@edwardmedia  
I dont see any error , I can attach the plan here if that makes sense

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.nginx-plus-firewall-rule will be created
  + resource "google_compute_firewall" "nginx-plus-firewall-rule" {
      + creation_timestamp = (known after apply)
      + description        = "Allow access to ports 80,443 and 8080 on all NGINX plus instances."
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "nginx-plus-fw-rule"
      + network            = "gce-api-vpc"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "nginx-plus-api-gwy",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_forwarding_rule.gce-ext-lb-forwarding-rule will be created
  + resource "google_compute_forwarding_rule" "gce-ext-lb-forwarding-rule" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "TCP"
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "gce-external-lb"
      + network               = (known after apply)
      + network_tier          = "STANDARD"
      + project               = (known after apply)
      + region                = (known after apply)
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.default will be created
  + resource "google_compute_http_health_check" "default" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "nginx-plus-health-check"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.nginx-plus-gwy-group-manager will be created
  + resource "google_compute_instance_group_manager" "nginx-plus-gwy-group-manager" {
      + base_instance_name = "nginx-plus-api-gwy"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "nginx-plus-gwy-instance-group-manager"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_size        = 3
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "australia-southeast1-a"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_template.nginx-plus-gwy-template will be created
  + resource "google_compute_instance_template" "nginx-plus-gwy-template" {
      + can_ip_forward       = false
      + id                   = (known after apply)
      + labels               = {
          + "environment" = "dev"
        }
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + name                 = "nginx-plus-gwy-template"
      + name_prefix          = (known after apply)
      + project              = (known after apply)
      + region               = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "nginx-plus-api-gwy",
        ]
      + tags_fingerprint     = (known after apply)

      + disk {
          + auto_delete  = true
          + boot         = true
          + device_name  = (known after apply)
          + disk_type    = (known after apply)
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "nginxplus-r22"
          + type         = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "gce-api-vpc"
          + subnetwork         = "gce-api-subnet"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip                 = (known after apply)
              + network_tier           = (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
            ]
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "gce-api-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.10.0.0/24"
      + name               = "gce-api-subnet"
      + network            = "gce-api-vpc"
      + project            = (known after apply)
      + region             = "australia-southeast1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_target_pool.default will be created
  + resource "google_compute_target_pool" "default" {
      + health_checks    = [
          + "nginx-plus-health-check",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "ext-loadbalancer-nginx-plus"
      + project          = (known after apply)
      + region           = (known after apply)
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }
```
